import telebot
from telebot import types
import backends.telebotFunctions as f

""" главное меню и команды """
""" кнопки главного меню и вызов функций !!!Заполнять здесь """
mainMenu = {
    "Справка": f.helpb,
    "О программе": f.about,
    "Состояние станков": f.status,
    "Отчет по простоям": f.report,
    "сбой": f.setReasons,
}
# генерация кнопок
markup = types.ReplyKeyboardMarkup()
for item in mainMenu.keys():
    markup.row(types.KeyboardButton(item))

""" меню встроенной клавиатуры """
downtimeMenu = {
    "Сбой системы мониторинга": "999",
    "Работа по карте несоответствий": "424",
    "Сборочные операции": "323",
    "Уборка, осмотр оборудования, чистка\смазка станка": "322",
    "Контроль ЦЗЛ": "329",
    "Контроль представителем заказчика": "328",
    "Контроль на рабочем месте": "321",
    "Изменение режимов, смена инструмента, приспособления": "320",
    "Установка, выверка, снятие детали": "319",
    "Работа с управляющей программой": "318",
    "Переналадка оборудования, получение инструмента до начала работ, снятие/сдача по окончанию работы": "317",
    "Ознакомление с работой, документацией и инструктаж": "316",
    "Естественные надобности": "215",
    "Отсутствие конструктора, технолога или ожидание его решения": "214",
    "Отсутствие/ожидание ЦЗЛ": "227",
    "Отсутствие/ожидание представителя заказчика": "226",
    "Отсутствие сотрудников ОТК": "213",
    "Отсутствие энергоносителей": "212",
    "Неявка оператора (б\лист, отпуск, командировка)": "211",
    "Отсутствие оператора в связи с необеспеченностью": "210",
    "Отсутствие крана, транспорта": "209",
    "Отсутствие инструмента, оснастки, вспомогательного оборудования": "208",
    "Отсутствие материалов, заготовок, деталей": "207",
    "Отсутствие задания": "206",
    "Аварийный ремонт централизованными службами": "205",
    "Плановый ремонт централизованными службами": "204",
    "Обед": "103",
    "Праздники и выходные": "102",
    "Ожидание ввода": "100",
    "Простой. Нерабочее время": "002",
    "Простой": "001",
    "Оборудование работает": "000"
}

# встроенная клавиатура
keyboard = types.InlineKeyboardMarkup()
for item in downtimeMenu.keys():
    keyboard.row(types.InlineKeyboardButton(item, callback_data = downtimeMenu[item]))

